In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [44]:
# ------------------------------------------------------
# 결측치 처리 - (1) 치환
# -seaborn에서 제공하는 titanic 데이터 사용
# ------------------------------------------------------
import seaborn as sns
ti=sns.load_dataset('titanic')

In [45]:
ti.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [46]:
ti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [47]:
ti.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
missingSR=ti.isnull().sum()

In [49]:
#결측치가 있는 데이터만 출력
ti.isnull().sum()[ti.isnull().sum()>0]

age            177
embarked         2
deck           688
embark_town      2
dtype: int64

In [50]:
fillter=missingSR>0
mask=missingSR>100
missingSR[fillter],missingSR[mask]

(age            177
 embarked         2
 deck           688
 embark_town      2
 dtype: int64,
 age     177
 deck    688
 dtype: int64)

In [51]:
# 결측치가 존재하는  컬럼에 값을 치환해서 결측치를 없애기
# fillna() 메서드
missingSR[fillter].index

Index(['age', 'embarked', 'deck', 'embark_town'], dtype='object')

In [40]:
ti['age'].fillna(0,inplace=True)#.isnull().sum()

In [66]:
ti['age'].fillna(method='ffill').isnull().sum()
ti['age'].fillna(method='bfill').isnull().sum()

0

In [67]:
ti['age'].fillna(ti['age'].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [68]:
ti['age'].fillna(ti.age.mode()).isnull().sum()

177

In [69]:
type(ti.age.mode())

pandas.core.series.Series

In [70]:
ti.age.mean()

29.69911764705882

In [72]:
ti['deck'].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [74]:
ti.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [2]:
import pandas as pd
data=[[10,20,30],['f','m','m'],[11,22,33],[44,55,66],['A','B','C']]
df1=pd.DataFrame(data)